
&НаКлиенте
Процедура ТаблицаАктВыполненныхРаботСтоимостьОдногоДняПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	СтрокаТабличнойЧасти = Элементы.ТаблицаАктВыполненныхРабот.ТекущиеДанные;
	РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаАктВыполненныхРаботАбонементПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	СтрокаТабличнойЧасти = Элементы.ТаблицаАктВыполненныхРабот.ТекущиеДанные;
	РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры


