
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ТабДок = Новый ТабличныйДокумент;
	Печать(ТабДок, ПараметрКоманды);
	ТабДок.Показать("ТалонТренировки");
	
КонецПроцедуры

&НаСервере
Процедура Печать(ТабДок, СсылкаНаДокумент)
	// получить макет
	Макет = Документы.Тренировки.ПолучитьМакет("ТалонТренировки");
	
	// получение областей из макета
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
	
	// заполненеи параметров и вывод областей в табличный документ
	Тест = ОбластьШапка.Параметры;
	ОбластьСтрокаТаблицы.Параметры.Дата = СсылкаНаДокумент.Дата;
	ОбластьСтрокаТаблицы.Параметры.Клиент = СсылкаНаДокумент.Клиент;
	ОбластьСтрокаТаблицы.Параметры.Зал = СсылкаНаДокумент.ВидЗала;
	
	// запрос в таблицу
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТренировкиТаблицаТренировки.НомерСтроки КАК НомерСтроки,
		|	ТренировкиТаблицаТренировки.Тренер КАК Тренер,
		|	ТренировкиТаблицаТренировки.Абонемент КАК Абонемент
		|ИЗ
		|	Документ.Тренировки.ТаблицаТренировки КАК ТренировкиТаблицаТренировки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОбластьСтрокаТаблицы.Параметры.НомерСтроки = ВыборкаДетальныеЗаписи.НомерСтроки;
		ОбластьСтрокаТаблицы.Параметры.Тренер = ВыборкаДетальныеЗаписи.Тренер;
		ОбластьСтрокаТаблицы.Параметры.Абонемент = ВыборкаДетальныеЗаписи.Абонемент;
	КонецЦикла;
	
	ТабДок.Вывести(ОбластьШапка);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	ТабДок.Вывести(ОбластьСтрокаТаблицы);

КонецПроцедуры