
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Загруженность Приход
	Движения.Загруженность.Записывать = Истина;
	Для Каждого ТекСтрокаТаблицаТренировки Из ТаблицаТренировки Цикл
		Движение = Движения.Загруженность.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Зал = ВидЗала;
		Движение.Тренер = ТекСтрокаТаблицаТренировки.Тренер;
		Движение.Абонемент = ТекСтрокаТаблицаТренировки.Абонемент;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
