export const regulation = [
    { "ОС": 0, "ПСЖ": 1 },
    { "ОС": 1, "ПСЖ": 0 },
    { "ПК": 0, "ПР": 0, "ПСЖ": 1 },
    { "ПСЖ": 0, "СОС": 1, "В": 1 },
    { "ПСЖ": 1, "ОЗУ": 1, "В": 1 },
    { "ПСЖ": 1, "ОЗУ": 1, "ВК": 1, "В": 0 },
    { "ПСЖ": 1, "ОЗУ": 1, "ВК": 1, "В": 1 },
    { "ПСЖ": 1, "ОЗУ": 1, "ВК": 1, "ЦП": 0, "В": 0 },
    { "ПСЖ": 1, "ОЗУ": 1, "ВК": 1, "ЦП": 1, "В": 1 },
    { "ПСЖ": 0, "ОС": 0, "СЭ": 0, "СОС": 0 },
    { "ПСЖ": 1, "ОС": 0, "СЭ": 1, "СОС": 1 },
    { "ПСЖ": 1, "ОЗУ": 1, "ВК": 1, "ЦП": 1, "В": 1 },
    { "ПК": 0, "ПР": 1, "ОС": 0, "ПСЖ": 1 },
]

export const abbreviations = [
    { "ПК": "персональный компьютер" },
    { "ПР": "проводка" },
    { "В": "вывод" },
    { "ОС": "операционная система" },
    { "ПСЖ": "проблема с железом" },
    { "ОЗУ": "оперативно запоминающее устройство " },
    { "ВК": "видеокарта" },
    { "ЦП": "центральный процессор" },
    { "СЭ": "синий экран" },
    { "СОС": "статус операционной системы" },
]

export const category = [
    { "app": "В" },
    { "app": "СОС" },
    { "app": "ПСЖ" },
    { "user": "ПК" },
    { "user": "ПР" },
    { "user": "ОС" },
    { "user": "ОЗУ" },
    { "user": "ВК" },
    { "user": "ЦП" },
    { "user": "СЭ" },
]

export const default_value = [
    "Введите первое значение по умолчанию",
    "Введите второе значение по умолчанию",
]