
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ТабДок = Новый ТабличныйДокумент;
	Печать(ТабДок, ПараметрКоманды);
	ТабДок.Показать("Клиент");
	
КонецПроцедуры

&НаСервере
Процедура Печать(ТабДок, СсылкаНаДокумент)
	// получить макет
	Макет = Документы.АктВыполненныхРабот.ПолучитьМакет("Клиент");
	
	// получение областей из макета
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АктВыполненныхРаботТаблицаАктВыполненныхРабот.НомерСтроки КАК НомерСтроки,
		|	АктВыполненныхРаботТаблицаАктВыполненныхРабот.СтоимостьОдногоДня КАК Стоимость,
		|	АктВыполненныхРаботТаблицаАктВыполненныхРабот.ВидСпорта КАК Услуга,
		|	АктВыполненныхРаботТаблицаАктВыполненныхРабот.Абонемент КАК Количество,
		|	АктВыполненныхРаботТаблицаАктВыполненныхРабот.ИтоговаяСтоимостьРублей КАК Всего
		|ИЗ
		|	Документ.АктВыполненныхРабот.ТаблицаАктВыполненныхРабот КАК АктВыполненныхРаботТаблицаАктВыполненныхРабот
		|ГДЕ
		|	АктВыполненныхРаботТаблицаАктВыполненныхРабот.Ссылка = &СсылкаНаДокумент";
	
	Запрос.УстановитьПараметр("СсылкаНаДокумент", СсылкаНаДокумент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СуммаИтого = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// заполненеи параметров и вывод областей в табличный документ
		ОбластьСтрокаТаблицы.Параметры.НомерСтроки = ВыборкаДетальныеЗаписи.НомерСтроки;
		ОбластьСтрокаТаблицы.Параметры.Услуга = ВыборкаДетальныеЗаписи.Услуга;
		ОбластьСтрокаТаблицы.Параметры.Количество = ВыборкаДетальныеЗаписи.Количество;
		ОбластьСтрокаТаблицы.Параметры.Стоимость = ВыборкаДетальныеЗаписи.Стоимость;
		ОбластьСтрокаТаблицы.Параметры.ОбщаяСтоимость = ВыборкаДетальныеЗаписи.Всего;
		СуммаИтого = СуммаИтого + ВыборкаДетальныеЗаписи.Всего;
	КонецЦикла;
	
	ОбластьПодвал.Параметры.СуммаИтого = СуммаИтого;
	
	ТабДок.Вывести(ОбластьШапка);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	ТабДок.Вывести(ОбластьСтрокаТаблицы);
	ТабДок.Вывести(ОбластьПодвал);

КонецПроцедуры